Revit 2024 API
PathReinforcement.Create Method
Overload List
Name | Description
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId)
 Creates a new PathReinforcement object from an array of curves. The newly created object will use a default Rebar Shape.
Create(Document, Element, IList<Curve>, Boolean, ElementId, ElementId, ElementId, ElementId, ElementId)
 Creates a new PathReinforcement object from an array of curves and given Rebar Shape id.
See Also
PathReinforcement Class
PathReinforcement Members
Autodesk.Revit.DB.Structure Namespace